In [1]:
import numpy as np
import pandas as pd

In [2]:
columns = ['W', 'X', 'Y', 'Z']

In [3]:
index = ['A', 'B', 'C', 'D', 'E']

In [4]:
from numpy.random import randint

In [5]:
np.random.seed(42)
data = randint(-100, 100, (5,4))

In [6]:
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [7]:
df = pd.DataFrame(data, index, columns)

In [8]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [9]:
df['W']

A     2
B     6
C     2
D    16
E    30
Name: W, dtype: int64

In [10]:
df[['W', 'Z']]

    W   Z
A   2 -86
B   6 -80
C   2 -13
D  16  51
E  30 -99

In [11]:
df['W']['A']

2

In [12]:
df['new'] = df['W'] + df['Y']

In [13]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [14]:
df.drop('new', axis = 1)

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [15]:
df.drop('A', axis=0)

    W   X   Y   Z  new
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [16]:
df.loc['A']

W       2
X      79
Y      -8
Z     -86
new    -6
Name: A, dtype: int64

In [17]:
df.loc[['A', 'E']]

    W   X   Y   Z  new
A   2  79  -8 -86   -6
E  30  49 -48 -99  -18

In [18]:
df.iloc[0]

W       2
X      79
Y      -8
Z     -86
new    -6
Name: A, dtype: int64

In [19]:
df.iloc[:2]

   W   X   Y   Z  new
A  2  79  -8 -86   -6
B  6 -29  88 -80   94

In [20]:
df.loc['A', 'W']

2

In [21]:
df.loc[['A', 'C'], ['W', 'Y']]

   W   Y
A  2  -8
C  2 -26

In [22]:
df > 0

      W      X      Y      Z    new
A  True   True  False  False  False
B  True  False   True  False   True
C  True   True  False  False  False
D  True  False   True   True   True
E  True   True  False  False  False

In [23]:
df[df > 0]

    W     X     Y     Z   new
A   2  79.0   NaN   NaN   NaN
B   6   NaN  88.0   NaN  94.0
C   2  21.0   NaN   NaN   NaN
D  16   NaN   3.0  51.0  19.0
E  30  49.0   NaN   NaN   NaN

In [24]:
df['X'] > 0

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [25]:
df[df['X'] > 0]

    W   X   Y   Z  new
A   2  79  -8 -86   -6
C   2  21 -26 -13  -24
E  30  49 -48 -99  -18

In [27]:
df[df['X'] > 0]['W']

A     2
C     2
E    30
Name: W, dtype: int64

In [31]:
df[(df['W'] > 0) & (df['Y'] > 1)]

    W   X   Y   Z  new
B   6 -29  88 -80   94
D  16  -1   3  51   19

In [34]:
df['States'] = new_ind = ['CA', 'NY', 'WY', 'OR', 'CO']

In [36]:
df = df.set_index('States')

In [37]:
df.columns

Index(['W', 'X', 'Y', 'Z', 'new'], dtype='object')

In [38]:
df.describe()

              W          X          Y          Z        new
count   5.00000   5.000000   5.000000   5.000000   5.000000
mean   11.20000  23.800000   1.800000 -45.400000  13.000000
std    11.96662  42.109381  51.915316  63.366395  48.187135
min     2.00000 -29.000000 -48.000000 -99.000000 -24.000000
25%     2.00000  -1.000000 -26.000000 -86.000000 -18.000000
50%     6.00000  21.000000  -8.000000 -80.000000  -6.000000
75%    16.00000  49.000000   3.000000 -13.000000  19.000000
max    30.00000  79.000000  88.000000  51.000000  94.000000

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 5 columns):
W      5 non-null int64
X      5 non-null int64
Y      5 non-null int64
Z      5 non-null int64
new    5 non-null int64
dtypes: int64(5)
memory usage: 240.0+ bytes